<!doctype html>
<html lang="zh-cn">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1,maximum-scale=1, user-scalable=no">
<title>使用条款（注册）</title>
<link rel="stylesheet" href="dist/css/bootstrap.min.css">
<link rel="stylesheet" href="dist/css/style.css">
  
</head>

<body>

<div class="container-fluid">
	 
	<div class="container" style="padding:10px;">
    	<div class="panel panel-default" style="border:0px; background:none; box-shadow: none ">
               
              <div class="panel-body font_12 line_h25" style="padding:10px 0px;text-align:left;">
                  <P>　　e保险网会员注册协议</P>
                  <P>　　请您在使用e保险app、注册e保险网会员之前仔细阅读如下条款。同意本协议并接受全部条款后注册成为会员，本协议具有合同效力。</P>
                  <P>　　第一章 会员定义</P>
                  <P>　　会员是指依据《e保险网会员注册协议》，通过e保险网平台自愿完成有效注册，并正常享有有关权利和须履行有关义务的自然人或组织机构。</P>
                  <P>　　第二章 会员的权利</P>
                  <P>　　会员享有：自愿入会权、会员资格被继承权、建议及意见权、自愿异动权和自由退会权、自愿购买交易权。</P>
                  <P>　　第三章 会员的义务</P>
                  <P>　　1.遵守所有与网络服务有关的网络协议、规定和程序，不得为任何非法目的而使用e保险网网络资源;</P>
                  <P>　　2.不得利用e保险网网络系统进行任何对互联网的正常运转造成不利影响的行为;</P>
                  <P>　　3.不得在e保险网互动内容中散布恐吓他人或威胁他人的谣言;</P>
                  <P>　　4.不得公然侮辱或者捏造事实诽谤、公开他人隐私或者对他人进行人身攻击;</P>
                  <P>　　5.不得窃取、盗用e保险网资源，发送垃圾短信、邮件干扰网络秩序;</P>
                  <P>　　6.不得故意制作、传播、使用计算机病毒、恶意软件等破坏性程序;</P>
                  <P>　　7.不得以虚假信息或恶意程序等套取积分等网站资源。</P>
                  <P>　　第四章 e保险网行使的权利</P>
                  <P>　　1.e保险网有权对触犯法律法规的、有不良行为的会员进行除名;</P>
                  <P>　　2.e保险网有权对提供虚假信息或是触犯相关法律的会员进行服务的合理变更或终止;</P>
                  <P>　　3.如会员行为严重损害e保险网的名誉和利益，有权追究其法律责任。</P>
                  <P>　　第五章 e保险网履行的义务</P>
                  <P>　　1.e保险网应维护会员合法权益，保护会员信息，保证不对外公开或向第三方提供任何会员的注册资料;</P>
                  <P>　　2.维护网页及交易平台的正常运行，并努力提升和改进技术，使会员的交易活动得以顺利进行，如因系统维护或升级的需要而需暂停网络服务，将尽可能事先进行通告。</P>
                  <P>　　第六章 隐私保护</P>
                  <P>　　e保险网对于会员的资料，进行统一封存管理，隐私保护。除获得会员或是国家安全部门授权外，e保险网不应对外或第三方泄露会员的任何信息。</P>
                  <P>　　第七章 免责声明</P>
                  <P>　　1.会员应严格遵守e保险网交易、出单、服务、会员管理等各项流程。因会员不按照流程操作而造成的损失或责任，由会员本人承担;</P>
                  <P>　　2.通过e保险网投保时，需要根据司法单位之要求向相关单位提供用户个人资料。因会员提供虚假信息资料而造成的损失或责任，由会员本人承担;</P>
                  <P>　　3.由于您对用户密码保管不善或与他人共享会员账号，由此导致的任何个人资料和客户信息的泄露，而造成的损失或责任，由会员本人承担;</P>
                  <P>　　4.任何由于客户计算机问题、黑客攻击、计算机病毒侵入或发作、因政府管制而造成的暂时性关闭等影响网络正常经营之不可抗力而造成的个人资料泄露、丢失、被盗用或被篡改等，e保险网不承担赔偿责任;</P>
                  <P>　　5.由于与本网站链接的其它网站所造成之个人资料泄露及由此而导致的任何法律争议和后果，e保险网不承担赔偿责任。</P>
                  <P>　　第八章 附则</P>
                  <P>　　1.会员注册协议的订立、执行、解释和争议的解决，均应适用中国法律并受中国法院管辖;</P>
                  <P>　　2.如双方就会员协议内容或其执行发生任何争议，双方应尽量友好协商解决;协商不成时，均可向e保险网所在地的司法机构提起诉讼;</P>
                  <P>　　3.本协议的解释权归e保险网。</P>
              </div>
        </div>
    </div>
    
</div>
<script src="dist/js/jquery.min.js"></script>
<script src="dist/js/bootstrap.min.js"></script>
<script src="dist/js/html5shiv.min.js"></script>
<script src="dist/js/respond.min.js"></script>
<script src="dist/js/public.js"></script>
</body>
</html>
