<?php
/*
*太平洋保险产品
* 代码名称	代码元素名称	代码元素值
是否电子保单	电子保单	           1
	        纸质保单	           2
	        电子保单+纸质保单	   3
是否标示	          是	           1
	          否	           0
证件类型	        身份证	1
	        护照	2
	        军官证	3
	        驾照	4
	        其他	5
	        组织机构代码	6
性别代码	男	1
	女	2
与投保人关系代码	本人	1
	配偶	2
	子女	3
	父母	4
	女儿	5
	其他	6
	儿子	7
业务交易码	新契约	8041
	退保	8009
	支付	8008
	激活码预约	8040
	保单状态查询	8015
	电子保单下载	8014
支付方式	刷卡	1
	现金	2
	转账	3
交易渠道	线上	1
	线下	2
消息状态编码	成功	000000
	失败	000001
保单状态	待支付	043002
	生效	043003
	退保	043004
 */


/**
 *
 * @author ytyan
 */
class TBC01ProductBase extends ProductBase {
    public static $codeTable = array(
        'isEPolicy' => array(
            1 => '电子保单',
            2 => '纸质保单',
            3 => '电子保单+纸质保单'
        ),
        'certificateType' => array(
            1 => '身份证',
            2 => '护照',
            3 => '军官证',
            4 => '驾照	',
            5 => '其他	',
            6 => '组织机构代码',
        ),
        'gender' => array(
            1 => '男',	
            2 => '女',
        ),
        'insuredRelationCode' => array(
            1 => '本人',
            2 => '配偶',
            3 => '子女',
            4 => '父母',
            5 => '女儿',
            6 => '其他',
            7 => '儿子'
        ),
        'transactionCode' => array(
            '8041' => '新契约',
            '8009' => '退保',
            '8008' => '支付',
            '8040' => '激活码预约',
            '8015' => '保单状态查询',
            '8014' => '电子保单下载'
        ),
        'payType' => array(
            1 => '刷卡',
            2 => '现金',
            3 => '转账'
        ),
        'transChannel' => array(
            1 => '线上',
            2 => '线下'
        ),
        'messageStatusCode' => array(
            '000000' => '成功',
            '000001' => '失败'
        ),
        'statusCode' => array(
            '043002' => '待支付',
            '043003' => '生效',
            '043004' => '退保'
        ),
    );
 
 
    
}
